docs/ger1000.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-05 Fri 02:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quantitative Reasoning</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Quantitative Reasoning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeb9a2e8">1. Chapter 1: Design</a>
<ul>
<li><a href="#orgff3b481">1.1. What is a study?</a></li>
<li><a href="#org729f1d4">1.2. Confounders</a></li>
<li><a href="#org2584dc8">1.3. Randomized-controlled experiments</a></li>
<li><a href="#org8080432">1.4. Observational Studies</a></li>
<li><a href="#org0929d97">1.5. Variable Types</a>
<ul>
<li><a href="#org00e7d36">1.5.1. Discrete</a></li>
<li><a href="#org995caf9">1.5.2. Continuous</a></li>
</ul>
</li>
<li><a href="#orgc13dc12">1.6. 2x2 contingency table</a></li>
<li><a href="#org07f2e91">1.7. Association</a></li>
<li><a href="#org0b5ea6e">1.8. Adherence</a></li>
<li><a href="#org256cdbb">1.9. Simpsons Paradox</a></li>
<li><a href="#org70c0ec0">1.10. Design</a>
<ul>
<li><a href="#org8845aa6">1.10.1. Theorem</a></li>
</ul>
</li>
<li><a href="#orga9a0b6b">1.11. Risk Ratio</a></li>
<li><a href="#org5d98bcb">1.12. Odds Ratio</a>
<ul>
<li><a href="#org2b998bd">1.12.1. Population vs Estimated RR</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a57b51">2. Chapter 2: Association</a>
<ul>
<li><a href="#orga5e90d3">2.1. Categorical Variables</a>
<ul>
<li><a href="#orgcf4ee44">2.1.1. Measurements of Association: RR and OR</a></li>
</ul>
</li>
<li><a href="#orgac17152">2.2. Measurement Variables</a>
<ul>
<li><a href="#orga267b9f">2.2.1. Bivariate data and Scatter Diagram</a></li>
<li><a href="#orgb83eda8">2.2.2. Exploring relationship</a></li>
<li><a href="#org4e48291">2.2.3. Correlation Coefficient</a></li>
<li><a href="#org45145b0">2.2.4. Standard Unit</a></li>
<li><a href="#org905ca29">2.2.5. Limitations</a>
<ul>
<li><a href="#orga0f69d4">2.2.5.1. Causation</a></li>
<li><a href="#orge813933">2.2.5.2. Outliers in data set</a></li>
<li><a href="#org189ef08">2.2.5.3. non-linear association</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge16f056">2.3. Ecological Correlation</a>
<ul>
<li><a href="#orgc56079e">2.3.1. Ecological Fallacy</a></li>
<li><a href="#orga7636a2">2.3.2. Atomistic Fallacy</a></li>
</ul>
</li>
<li><a href="#orgf85fbd5">2.4. Association</a>
<ul>
<li><a href="#org6379c73">2.4.1. Attentuation Effect</a></li>
<li><a href="#org6e6bb60">2.4.2. Regression fallacy</a></li>
</ul>
</li>
<li><a href="#org5423449">2.5. Prediction with linear regression</a></li>
</ul>
</li>
<li><a href="#orgad070bd">3. Chapter 3: Sampling</a>
<ul>
<li><a href="#org25b168e">3.1. Definitions</a></li>
<li><a href="#org1f2f785">3.2. Sampling methods</a></li>
<li><a href="#org98cbc05">3.3. Difficulties in Sampling</a></li>
</ul>
</li>
<li><a href="#orge22a59b">4. Chapter 4: Probability</a>
<ul>
<li><a href="#orgd681f08">4.1. Interpretations</a></li>
<li><a href="#org3b8a366">4.2. P-values</a></li>
<li><a href="#org424fc2a">4.3. Testing rare events (Medical screening)</a></li>
</ul>
</li>
<li><a href="#orgee39a01">5. Chapter 5: Networks</a>
<ul>
<li><a href="#org4b44a59">5.1. Definitions</a></li>
<li><a href="#orge31cb4f">5.2. Centrality</a></li>
</ul>
</li>
<li><a href="#org33e0dfb">6. Appendix: Answering Questions</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgeb9a2e8" class="outline-2">
<h2 id="orgeb9a2e8"><span class="section-number-2">1</span> Chapter 1: Design</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgff3b481" class="outline-3">
<h3 id="orgff3b481"><span class="section-number-3">1.1</span> What is a study?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A study seeks to establish whether there is an <i>association</i> between a
<i>dependent</i> and <i>independent</i> variable.
</p>

<p>
Statisticians use the method of comparison to find the effect of
<span class="underline">treatment/exposure</span> on a <span class="underline">disease/response</span>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">exposure</th>
<th scope="col" class="org-left">response</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">vaccine</td>
<td class="org-left">polio</td>
</tr>

<tr>
<td class="org-left">heart disease</td>
<td class="org-left">polio</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">smoking</td>
<td class="org-left">heart disease</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">obesity</td>
<td class="org-left">depression</td>
</tr>
</tbody>
</table>

<p>
Compare the responses of a treatment group to a control group.
</p>
</div>
</div>
<div id="outline-container-org729f1d4" class="outline-3">
<h3 id="org729f1d4"><span class="section-number-3">1.2</span> Confounders</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>If the control group is similar to the treatment group, apart from
the treatment, the differences in response are likely to be due to
the effect of the exposure</li>
<li>If not, then other effects could be "confounded" with the results of
the treatment. These are called confounders.</li>
<li>Confounders must be associated with both the exposure and the response</li>
<li>Minimized through randomized-control.</li>
</ul>
</div>
</div>
<div id="outline-container-org2584dc8" class="outline-3">
<h3 id="org2584dc8"><span class="section-number-3">1.3</span> Randomized-controlled experiments</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Objective: ensure similarity between treatment and control group
</p>

<ol class="org-ol">
<li>Put subjects into treatment and control at random</li>
<li>If possible, give control placebo:
<ul class="org-ul">
<li>neutral, but resembles treatment.</li>
<li>Response should be treatment itself and not idea of it</li>
</ul></li>
<li>Double-blind:
<ul class="org-ul">
<li>Subjects and evaluators do not know whether subject is in
treatment or control group.</li>
<li>Prevents bias in analysis</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org8080432" class="outline-3">
<h3 id="org8080432"><span class="section-number-3">1.4</span> Observational Studies</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In controlled experiments, investigators decide who will be in the
treatment group and who will be in the control group.
</p>

<p>
In observational studies, subjects assign themselves to the different
groups. To see if confounding is a problem, look at how the exposed
and non-exposed groups are selected.
</p>

<p>
One way to control for confounders is to make comparisons for smaller
and more homogeneous grups (eg. by age, sex). This is called
"slicing" (not an official term).
</p>

<p>
Observational studies can establish <i>association</i>. But association
does not imply causation.
</p>
</div>
</div>
<div id="outline-container-org0929d97" class="outline-3">
<h3 id="org0929d97"><span class="section-number-3">1.5</span> Variable Types</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org00e7d36" class="outline-4">
<h4 id="org00e7d36"><span class="section-number-4">1.5.1</span> Discrete</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Smoking is an example of a <i>discrete</i> variable (a.k.a. categorical
variable).
</p>

<p>
Eg. Smoking has two categories (binary categorical): you smoke or you
don't.
</p>
</div>
</div>
<div id="outline-container-org995caf9" class="outline-4">
<h4 id="org995caf9"><span class="section-number-4">1.5.2</span> Continuous</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
a.k.a. numerical, measurement
</p>
</div>
</div>
</div>
<div id="outline-container-orgc13dc12" class="outline-3">
<h3 id="orgc13dc12"><span class="section-number-3">1.6</span> 2x2 contingency table</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Y</th>
<th scope="col" class="org-left">not Y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">a</td>
<td class="org-left">c</td>
</tr>

<tr>
<td class="org-left">not A</td>
<td class="org-left">b</td>
<td class="org-left">d</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org07f2e91" class="outline-3">
<h3 id="org07f2e91"><span class="section-number-3">1.7</span> Association</h3>
<div class="outline-text-3" id="text-1-7">
<p>
A and Y are associated if
</p>

<div class="org-src-container">
<pre class="src src-text">(1) rate(A|Y) != rate(A|!Y) OR
(2) rate(Y|A) != rate(Y|!A)
</pre>
</div>

<p>
Consistency rule states than (1) iff (2), and vice-versa.
</p>

<div class="org-src-container">
<pre class="src src-text">a/(a+c) != b/(b+d)
a/(a+b) != c/(c+d)
</pre>
</div>
</div>
</div>
