content/posts/ger1000.md
+++
title = "Quantitative Reasoning"
author = ["Jethro Kuan"]
lastmod = 2020-05-31T01:09:51+08:00
draft = false
+++

## Chapter 1: Design {#chapter-1-design}

### What is a study? {#what-is-a-study}

A study seeks to establish whether there is an _association_ between a
_dependent_ and _independent_ variable.

Statisticians use the method of comparison to find the effect of
<span class="underline">treatment/exposure</span> on a <span class="underline">disease/response</span>.

| exposure      | response      |
| ------------- | ------------- |
| vaccine       | polio         |
| heart disease | polio         |
| smoking       | heart disease |
| obesity       | depression    |

Compare the responses of a treatment group to a control group.

### Confounders {#confounders}

- If the control group is similar to the treatment group, apart from
  the treatment, the differences in response are likely to be due to
  the effect of the exposure
- If not, then other effects could be "confounded" with the results of
  the treatment. These are called confounders.
- Confounders must be associated with both the exposure and the response
- Minimized through randomized-control.

### Randomized-controlled experiments {#randomized-controlled-experiments}

Objective: ensure similarity between treatment and control group

1.  Put subjects into treatment and control at random
2.  If possible, give control placebo:
    - neutral, but resembles treatment.
    - Response should be treatment itself and not idea of it
3.  Double-blind:
    - Subjects and evaluators do not know whether subject is in
      treatment or control group.
    - Prevents bias in analysis

### Observational Studies {#observational-studies}

In controlled experiments, investigators decide who will be in the
treatment group and who will be in the control group.

In observational studies, subjects assign themselves to the different
groups. To see if confounding is a problem, look at how the exposed
and non-exposed groups are selected.

One way to control for confounders is to make comparisons for smaller
and more homogeneous grups (eg. by age, sex). This is called
"slicing" (not an official term).

Observational studies can establish _association_. But association
does not imply causation.

### Variable Types {#variable-types}

<!--list-separator-->

- Discrete

  Smoking is an example of a _discrete_ variable (a.k.a. categorical
  variable).

  Eg. Smoking has two categories (binary categorical): you smoke or you
  don't.

<!--list-separator-->

- Continuous

  a.k.a. numerical, measurement

### 2x2 contingency table {#2x2-contingency-table}

|       | Y   | not Y |
| ----- | --- | ----- |
| A     | a   | c     |
| not A | b   | d     |

### Association {#association}

A and Y are associated if

```text
(1) rate(A|Y) != rate(A|!Y) OR
(2) rate(Y|A) != rate(Y|!A)
```

Consistency rule states than (1) iff (2), and vice-versa.

```text
a/(a+c) != b/(b+d)
a/(a+b) != c/(c+d)
```
