docs/ger1000.html

<div id="outline-container-org0b5ea6e" class="outline-3">
<h3 id="org0b5ea6e"><span class="section-number-3">1.8</span> Adherence</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Assignment may be random, but adherence is not</li>
<li>Clues in to success of blinding (eg. drug has negative side effects)</li>
</ul>
</div>
</div>
<div id="outline-container-org256cdbb" class="outline-3">
<h3 id="org256cdbb"><span class="section-number-3">1.9</span> Simpsons Paradox</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Relationships between percentages in subgroups can be reversed if
subgroups are combined.
</p>
</div>
</div>
<div id="outline-container-org70c0ec0" class="outline-3">
<h3 id="org70c0ec0"><span class="section-number-3">1.10</span> Design</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Experimental
<ul class="org-ul">
<li>Controlled
<ul class="org-ul">
<li>Randomized</li>
</ul></li>
<li>Not controlled</li>
</ul></li>
<li>Observational</li>
</ul>

<p>
Randomized and controlled studies minimize confounding.
</p>
</div>

<div id="outline-container-org8845aa6" class="outline-4">
<h4 id="org8845aa6"><span class="section-number-4">1.10.1</span> Theorem</h4>
<div class="outline-text-4" id="text-1-10-1">
<p>
Suppose units are randomly assigned to be exposed or not. If the
sample size is very large, then the likelihood that a given variable C
is not associated to exposure x tends to almost certainty.
</p>
</div>
</div>
</div>

<div id="outline-container-orga9a0b6b" class="outline-3">
<h3 id="orga9a0b6b"><span class="section-number-3">1.11</span> Risk Ratio</h3>
<div class="outline-text-3" id="text-1-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A</td>
<td class="org-left">not A</td>
<td class="org-left">row Total</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">x</td>
<td class="org-left">y</td>
<td class="org-left">x + y</td>
</tr>

<tr>
<td class="org-left">not B</td>
<td class="org-left">a</td>
<td class="org-left">b</td>
<td class="org-left">a + b</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">risk (A | B) = x / (x+y)
risk (A | !B) = a / (a+b)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">RR = risk(A|B) / risk(A|!B)
RR = 1 means no association
</pre>
</div>

<ul class="org-ul">
<li>RR &gt; 1 =&gt; first group has higher risk</li>
<li>Population risk cannot be estimated in case-control studies, even
with random samples.</li>
</ul>
</div>
</div>

<div id="outline-container-org5d98bcb" class="outline-3">
<h3 id="org5d98bcb"><span class="section-number-3">1.12</span> Odds Ratio</h3>
<div class="outline-text-3" id="text-1-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A</td>
<td class="org-left">not A</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">x</td>
<td class="org-left">y</td>
</tr>

<tr>
<td class="org-left">not B</td>
<td class="org-left">a</td>
<td class="org-left">b</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">odds(A|B) = x/y
odds(A|!B)= a/b

OR = bx/ay
odds = risk/(1-risk)
</pre>
</div>
</div>

<div id="outline-container-org2b998bd" class="outline-4">
<h4 id="org2b998bd"><span class="section-number-4">1.12.1</span> Population vs Estimated RR</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
population sample size too large, calculation done based on samples.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Study</th>
<th scope="col" class="org-left">Samples from</th>
<th scope="col" class="org-left">Advantage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Cohort</td>
<td class="org-left">Exposure</td>
<td class="org-left">Risk and RR can be estimated</td>
</tr>

<tr>
<td class="org-left">Case-control</td>
<td class="org-left">Response</td>
<td class="org-left">Good for rare diseases</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-org7a57b51" class="outline-2">
<h2 id="org7a57b51"><span class="section-number-2">2</span> Chapter 2: Association</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Deterministic Relationship
<ul class="org-ul">
<li>Value of variable can be determined if we know the value of the
other variable</li>
</ul></li>
<li>Statistical Relationship
<ul class="org-ul">
<li>Natural variability exists in measurements</li>
<li>Average pattern of one variable can be described given the value
of the other variable</li>
</ul></li>
</ol>
</div>

<div id="outline-container-orga5e90d3" class="outline-3">
<h3 id="orga5e90d3"><span class="section-number-3">2.1</span> Categorical Variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Data that consists of group or category names. Measurements can be
grouped too.
</p>
</div>

<div id="outline-container-orgcf4ee44" class="outline-4">
<h4 id="orgcf4ee44"><span class="section-number-4">2.1.1</span> Measurements of Association: RR and OR</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>RR and OR can be accurately estimated to a cohort study</li>
<li>RR is intuitively clearer and can only be estimated from cohort
studies</li>
<li>OR applies to both cohort and case-control studies</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgac17152" class="outline-3">
<h3 id="orgac17152"><span class="section-number-3">2.2</span> Measurement Variables</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orga267b9f" class="outline-4">
<h4 id="orga267b9f"><span class="section-number-4">2.2.1</span> Bivariate data and Scatter Diagram</h4>
</div>
<div id="outline-container-orgb83eda8" class="outline-4">
<h4 id="orgb83eda8"><span class="section-number-4">2.2.2</span> Exploring relationship</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Average: eg. son's average height is taller than dad
association: positive gradient?
linear or exponential relationship?
Standard deviation: spread or variability of data
</p>
</div>
</div>
<div id="outline-container-org4e48291" class="outline-4">
<h4 id="org4e48291"><span class="section-number-4">2.2.3</span> Correlation Coefficient</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Summarizes direction and strength of linear association: -1 &lt;= r &lt;= 1
</p>

<ul class="org-ul">
<li>r &gt; 0 positive association</li>
<li>r &lt; 0 negative association</li>
<li>r = 0 no association</li>
<li>r = 1 perfectly positive association</li>
<li>r value close to 0 weak association</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">weak   moderate    strong
0    0.3        0.7       1
</pre>
</div>

<p>
Not affected by:
</p>
<ol class="org-ol">
<li>Interchanging two variables</li>
<li>Adding a number to all values of a variable</li>
<li>Multiplying a number to all values of a variable</li>
</ol>
</div>
</div>
<div id="outline-container-org45145b0" class="outline-4">
<h4 id="org45145b0"><span class="section-number-4">2.2.4</span> Standard Unit</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-text">SU = (X - X_bar) / sd_x 
</pre>
</div>

<p>
To obtain r, obtain the product of standard unit of father-son pairs,
then take the average of the products
</p>
</div>
</div>

<div id="outline-container-org905ca29" class="outline-4">
<h4 id="org905ca29"><span class="section-number-4">2.2.5</span> Limitations</h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
<div id="outline-container-orga0f69d4" class="outline-5">
<h5 id="orga0f69d4"><span class="section-number-5">2.2.5.1</span> Causation</h5>
<div class="outline-text-5" id="text-2-2-5-1">
<p>
A change in one variable produces a change in the other variable.
</p>
</div>
</div>
