content/posts/ger1000.md

### Adherence {#adherence}

- Assignment may be random, but adherence is not
- Clues in to success of blinding (eg. drug has negative side effects)

### Simpsons Paradox {#simpsons-paradox}

Relationships between percentages in subgroups can be reversed if
subgroups are combined.

### Design {#design}

- Experimental
  - Controlled
    - Randomized
  - Not controlled
- Observational

Randomized and controlled studies minimize confounding.

<!--list-separator-->

- Theorem

  Suppose units are randomly assigned to be exposed or not. If the
  sample size is very large, then the likelihood that a given variable C
  is not associated to exposure x tends to almost certainty.

### Risk Ratio {#risk-ratio}

|       | A   | not A | row Total |
| ----- | --- | ----- | --------- |
| B     | x   | y     | x + y     |
| not B | a   | b     | a + b     |

```text
risk (A | B) = x / (x+y)
risk (A | !B) = a / (a+b)
```

```text
RR = risk(A|B) / risk(A|!B)
RR = 1 means no association
```

- RR > 1 => first group has higher risk
- Population risk cannot be estimated in case-control studies, even
  with random samples.

### Odds Ratio {#odds-ratio}

|       | A   | not A |
| ----- | --- | ----- |
| B     | x   | y     |
| not B | a   | b     |

```text
odds(A|B) = x/y
odds(A|!B)= a/b

OR = bx/ay
odds = risk/(1-risk)
```

<!--list-separator-->

- Population vs Estimated RR

  population sample size too large, calculation done based on samples.

  | Study        | Samples from | Advantage                    |
  | ------------ | ------------ | ---------------------------- |
  | Cohort       | Exposure     | Risk and RR can be estimated |
  | Case-control | Response     | Good for rare diseases       |

## Chapter 2: Association {#chapter-2-association}

1.  Deterministic Relationship
    - Value of variable can be determined if we know the value of the
      other variable
2.  Statistical Relationship
    - Natural variability exists in measurements
    - Average pattern of one variable can be described given the value
      of the other variable

### Categorical Variables {#categorical-variables}

Data that consists of group or category names. Measurements can be
grouped too.

<!--list-separator-->

- Measurements of Association: RR and OR

  - RR and OR can be accurately estimated to a cohort study
  - RR is intuitively clearer and can only be estimated from cohort
    studies
  - OR applies to both cohort and case-control studies

### Measurement Variables {#measurement-variables}

<!--list-separator-->

- Bivariate data and Scatter Diagram

<!--list-separator-->

- Exploring relationship

  Average: eg. son's average height is taller than dad
  association: positive gradient?
  linear or exponential relationship?
  Standard deviation: spread or variability of data

<!--list-separator-->

- Correlation Coefficient

  Summarizes direction and strength of linear association: -1 <= r <= 1

  - r > 0 positive association
  - r < 0 negative association
  - r = 0 no association
  - r = 1 perfectly positive association
  - r value close to 0 weak association

   <!--listend-->

  ```text
  weak   moderate    strong
  0    0.3        0.7       1
  ```

  Not affected by:

  1.  Interchanging two variables
  2.  Adding a number to all values of a variable
  3.  Multiplying a number to all values of a variable

<!--list-separator-->

- Standard Unit

  ```text
  SU = (X - X_bar) / sd_x
  ```

  To obtain r, obtain the product of standard unit of father-son pairs,
  then take the average of the products

<!--list-separator-->

- Limitations

   <!--list-separator-->

  - Causation

    A change in one variable produces a change in the other variable.

   <!--list-separator-->
