org/reference/ger1000.org
**** Outliers in data set
Data points that are unusually far away from the bulk of the data.
Dangerous to exclude outliers without understanding the cause of the
occurrence.
**** non-linear association
- zero correlation only says no "linear association"
- high correlation doesn't mean linear association
** Ecological Correlation
Correlation based on aggregated data, such as gorup averages or rates.

In general, when the associations for both individuals and aggregates
are in the same direction, the ecological correlation, based on the
aggregates, will typically overstate the strength of the association
in individuals.

Variability among individuals are eliminated during aggregation
*** Ecological Fallacy
Deduction of inferences about individuals based on aggregate data
*** Atomistic Fallacy
Generalize the correlation based on individuals toward the aggregate
level correlation 
** Association
*** Attentuation Effect
#+begin_quote
Due to range restriction in one variable, the correlation coefficient
obtained tends to understate the strength of association between two
variables.
#+end_quote
Range restriction: bivariate data set formed based on criteria on one
variable data for the other variable is only available for a limited
range.

Range restriction tends to have diminishing influence on the strength
of the association, called the attenuation effect.
*** Regression fallacy
#+begin_quote
In virtual test-retest situations, the bottom group on the first test
will on average show some improvement on the second test, and the top
group will, on average, fall back.
#+end_quote
** Prediction with linear regression
Y = a + bX

slope and intercept determined using least-square-method. Predicting
"average", not exact. Also dangerous to predict beyond observed range.
* Chapter 3: Sampling
** Definitions
1. Unit: Object/Individual
2. Population: Collection of units
3. Sample: Subset of a population
4. Sampling frame: list of sampling units intended to identify all
   units in the population
   1. Good Coverage
   2. Up-to-date and complete
** Sampling methods
1. Probability Sampling
   - Every unit must have a known probability of being sampled
   - Simple random sampling: all units have equal probability
2. Systematic sampling
   - Selecting units from a list through the application of a
     selection interval K, so every Kth unit following a random start
     is included in the sample
   - treated as simple random when sampling units are arranged randomly
   - might obtain undesirable sample if sampling units and K have
     cyclical effect
   - can use when # sampling units unknown
3. Stratified
   - first divide population of units into strata, take a probability
     sample from each group
4. Multi-stage
** Difficulties in Sampling
1. Imperfect sample frame
   - Perfect sampling frame consists of all units in population
   - otherwise, might include unwanted units (increased cost of
     study), or exclude desired units (need to redefine target population).
2. Non-response
   - not all units are contactable, willing to take part.
     Non-respondents typically differ from respondents, and this
     effect needs to be studied.
3. Volunteer sample (biased)
4. Convenience sample (biased)
5. Judgement sample (uses own discretion, biased)
6. Quota sample (Having proportions of categories dose not make
   extension of results to population better)
* Chapter 4: Probability
** Interpretations
| Relative Frequency                        | Personal Probability                            |
|-------------------------------------------+-------------------------------------------------|
| Will you win the lottery                  | Will you be working overseas once you graduate? |
| Can be quantified exactly                 | Cannot be quantified exactly                    |
| Based on repeated observation of outcomes | Based on personal belief                        |

Odds of having disease = P(disease) / P(no disease)

Average value = expected value
