docs/ger1000.html
<div id="outline-container-orge813933" class="outline-5">
<h5 id="orge813933"><span class="section-number-5">2.2.5.2</span> Outliers in data set</h5>
<div class="outline-text-5" id="text-2-2-5-2">
<p>
Data points that are unusually far away from the bulk of the data.
Dangerous to exclude outliers without understanding the cause of the
occurrence.
</p>
</div>
</div>
<div id="outline-container-org189ef08" class="outline-5">
<h5 id="org189ef08"><span class="section-number-5">2.2.5.3</span> non-linear association</h5>
<div class="outline-text-5" id="text-2-2-5-3">
<ul class="org-ul">
<li>zero correlation only says no "linear association"</li>
<li>high correlation doesn't mean linear association</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orge16f056" class="outline-3">
<h3 id="orge16f056"><span class="section-number-3">2.3</span> Ecological Correlation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Correlation based on aggregated data, such as gorup averages or rates.
</p>

<p>
In general, when the associations for both individuals and aggregates
are in the same direction, the ecological correlation, based on the
aggregates, will typically overstate the strength of the association
in individuals.
</p>

<p>
Variability among individuals are eliminated during aggregation
</p>
</div>
<div id="outline-container-orgc56079e" class="outline-4">
<h4 id="orgc56079e"><span class="section-number-4">2.3.1</span> Ecological Fallacy</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Deduction of inferences about individuals based on aggregate data
</p>
</div>
</div>
<div id="outline-container-orga7636a2" class="outline-4">
<h4 id="orga7636a2"><span class="section-number-4">2.3.2</span> Atomistic Fallacy</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Generalize the correlation based on individuals toward the aggregate
level correlation 
</p>
</div>
</div>
</div>
<div id="outline-container-orgf85fbd5" class="outline-3">
<h3 id="orgf85fbd5"><span class="section-number-3">2.4</span> Association</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org6379c73" class="outline-4">
<h4 id="org6379c73"><span class="section-number-4">2.4.1</span> Attentuation Effect</h4>
<div class="outline-text-4" id="text-2-4-1">
<blockquote>
<p>
Due to range restriction in one variable, the correlation coefficient
obtained tends to understate the strength of association between two
variables.
</p>
</blockquote>
<p>
Range restriction: bivariate data set formed based on criteria on one
variable data for the other variable is only available for a limited
range.
</p>

<p>
Range restriction tends to have diminishing influence on the strength
of the association, called the attenuation effect.
</p>
</div>
</div>
<div id="outline-container-org6e6bb60" class="outline-4">
<h4 id="org6e6bb60"><span class="section-number-4">2.4.2</span> Regression fallacy</h4>
<div class="outline-text-4" id="text-2-4-2">
<blockquote>
<p>
In virtual test-retest situations, the bottom group on the first test
will on average show some improvement on the second test, and the top
group will, on average, fall back.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org5423449" class="outline-3">
<h3 id="org5423449"><span class="section-number-3">2.5</span> Prediction with linear regression</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Y = a + bX
</p>

<p>
slope and intercept determined using least-square-method. Predicting
"average", not exact. Also dangerous to predict beyond observed range.
</p>
</div>
</div>
</div>
<div id="outline-container-orgad070bd" class="outline-2">
<h2 id="orgad070bd"><span class="section-number-2">3</span> Chapter 3: Sampling</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org25b168e" class="outline-3">
<h3 id="org25b168e"><span class="section-number-3">3.1</span> Definitions</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Unit: Object/Individual</li>
<li>Population: Collection of units</li>
<li>Sample: Subset of a population</li>
<li>Sampling frame: list of sampling units intended to identify all
units in the population
<ol class="org-ol">
<li>Good Coverage</li>
<li>Up-to-date and complete</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org1f2f785" class="outline-3">
<h3 id="org1f2f785"><span class="section-number-3">3.2</span> Sampling methods</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Probability Sampling
<ul class="org-ul">
<li>Every unit must have a known probability of being sampled</li>
<li>Simple random sampling: all units have equal probability</li>
</ul></li>
<li>Systematic sampling
<ul class="org-ul">
<li>Selecting units from a list through the application of a
selection interval K, so every Kth unit following a random start
is included in the sample</li>
<li>treated as simple random when sampling units are arranged randomly</li>
<li>might obtain undesirable sample if sampling units and K have
cyclical effect</li>
<li>can use when # sampling units unknown</li>
</ul></li>
<li>Stratified
<ul class="org-ul">
<li>first divide population of units into strata, take a probability
sample from each group</li>
</ul></li>
<li>Multi-stage</li>
</ol>
</div>
</div>
<div id="outline-container-org98cbc05" class="outline-3">
<h3 id="org98cbc05"><span class="section-number-3">3.3</span> Difficulties in Sampling</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>Imperfect sample frame
<ul class="org-ul">
<li>Perfect sampling frame consists of all units in population</li>
<li>otherwise, might include unwanted units (increased cost of
study), or exclude desired units (need to redefine target population).</li>
</ul></li>
<li>Non-response
<ul class="org-ul">
<li>not all units are contactable, willing to take part.
Non-respondents typically differ from respondents, and this
effect needs to be studied.</li>
</ul></li>
<li>Volunteer sample (biased)</li>
<li>Convenience sample (biased)</li>
<li>Judgement sample (uses own discretion, biased)</li>
<li>Quota sample (Having proportions of categories dose not make
extension of results to population better)</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge22a59b" class="outline-2">
<h2 id="orge22a59b"><span class="section-number-2">4</span> Chapter 4: Probability</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd681f08" class="outline-3">
<h3 id="orgd681f08"><span class="section-number-3">4.1</span> Interpretations</h3>
<div class="outline-text-3" id="text-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Relative Frequency</th>
<th scope="col" class="org-left">Personal Probability</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Will you win the lottery</td>
<td class="org-left">Will you be working overseas once you graduate?</td>
</tr>

<tr>
<td class="org-left">Can be quantified exactly</td>
<td class="org-left">Cannot be quantified exactly</td>
</tr>

<tr>
<td class="org-left">Based on repeated observation of outcomes</td>
<td class="org-left">Based on personal belief</td>
</tr>
</tbody>
</table>

<p>
Odds of having disease = P(disease) / P(no disease)
</p>

<p>
Average value = expected value
</p>
</div>
</div>
