docs/ger1000.html
<div id="outline-container-org3b8a366" class="outline-3">
<h3 id="org3b8a366"><span class="section-number-3">4.2</span> P-values</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>p-value = the probability of obtaining an outcome <i>equivalent to or
more extreme</i> than the observed</li>
<li>null hypothesis: assumption used to calculate p-value (eg. coin is fair)</li>
<li>if p-value is small, unlikely for observed to occur by chance, and
unlikely for null hypothesis to be true. Converse for large.</li>
<li>p-value &gt; 0.05 : do not reject NH at 5% significance level. Cannot
conclude that it is not fair. Observed effect in sample is likely
to reflect effect in population.</li>
</ul>
</div>
</div>
<div id="outline-container-org424fc2a" class="outline-3">
<h3 id="org424fc2a"><span class="section-number-3">4.3</span> Testing rare events (Medical screening)</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>Base rate: P(disease)</li>
<li>Sensitivity: P(positive | disease)</li>
<li>Specificity: P(negative | no disease)</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">To test</th>
<th scope="col" class="org-left">Not to test</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">no alternative test</td>
<td class="org-left">Alternative more reliable test</td>
</tr>

<tr>
<td class="org-left">Test is inexpensive &amp; more expensive 2nd test</td>
<td class="org-left">Test is expensive</td>
</tr>

<tr>
<td class="org-left">Goo chance of successful treatment</td>
<td class="org-left">Unreliable treatment</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgee39a01" class="outline-2">
<h2 id="orgee39a01"><span class="section-number-2">5</span> Chapter 5: Networks</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Collection of objects and well-defined relations between objects</li>
</ul>
</div>
<div id="outline-container-org4b44a59" class="outline-3">
<h3 id="org4b44a59"><span class="section-number-3">5.1</span> Definitions</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Degree: number of other vertices in the network a node is adjacent to</li>
<li>Order: number of vertices</li>
<li>Size: number of edges</li>
<li>Distance d(X,Y) = distance between X and Y</li>
</ol>
</div>
</div>
<div id="outline-container-orge31cb4f" class="outline-3">
<h3 id="orge31cb4f"><span class="section-number-3">5.2</span> Centrality</h3>
<div class="outline-text-3" id="text-5-2">
<p>
n vertices
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Centrality</th>
<th scope="col" class="org-left">Formula</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Closeness</td>
<td class="org-left">Ccen(u) = sum[d(u,vi)/ n-1 ]</td>
</tr>

<tr>
<td class="org-left">Degree</td>
<td class="org-left">Dcen(u) = deg(u) / n-1</td>
</tr>
</tbody>
</table>

<p>
Betweeness: For a vertex Z in any graph, how many shortest paths are
there, between any pair of 2 vertices, passing through Z?
</p>

<p>
If 2 shortest paths between a,b, only 1 pass through z, add 1/2.
</p>
</div>
</div>
</div>
<div id="outline-container-org33e0dfb" class="outline-2">
<h2 id="org33e0dfb"><span class="section-number-2">6</span> Appendix: Answering Questions</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>exposure (potential cause)</li>
<li>response (potential effect)</li>
<li>design</li>
<li>sampling</li>
<li>unit</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-05 Fri 02:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
