content/posts/ger1000.md

### P-values {#p-values}

- p-value = the probability of obtaining an outcome _equivalent to or
  more extreme_ than the observed
- null hypothesis: assumption used to calculate p-value (eg. coin is fair)
- if p-value is small, unlikely for observed to occur by chance, and
  unlikely for null hypothesis to be true. Converse for large.
- p-value > 0.05 : do not reject NH at 5% significance level. Cannot
  conclude that it is not fair. Observed effect in sample is likely
  to reflect effect in population.

### Testing rare events (Medical screening) {#testing-rare-events--medical-screening}

1.  Base rate: P(disease)
2.  Sensitivity: P(positive | disease)
3.  Specificity: P(negative | no disease)

| To test                                       | Not to test                    |
| --------------------------------------------- | ------------------------------ |
| no alternative test                           | Alternative more reliable test |
| Test is inexpensive & more expensive 2nd test | Test is expensive              |
| Goo chance of successful treatment            | Unreliable treatment           |

## Chapter 5: Networks {#chapter-5-networks}

- Collection of objects and well-defined relations between objects

### Definitions {#definitions}

1.  Degree: number of other vertices in the network a node is adjacent to
2.  Order: number of vertices
3.  Size: number of edges
4.  Distance d(X,Y) = distance between X and Y

### Centrality {#centrality}

n vertices

| Centrality | Formula                      |
| ---------- | ---------------------------- |
| Closeness  | Ccen(u) = sum[d(u,vi)/ n-1 ] |
| Degree     | Dcen(u) = deg(u) / n-1       |

Betweeness: For a vertex Z in any graph, how many shortest paths are
there, between any pair of 2 vertices, passing through Z?

If 2 shortest paths between a,b, only 1 pass through z, add 1/2.

## Appendix: Answering Questions {#appendix-answering-questions}

- exposure (potential cause)
- response (potential effect)
- design
- sampling
- unit
